# GetHostedSubRegionIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..GetHostedSubRegionIds Method
TopographySurface Class See Also
---
Gets the ids of all subregion elements hosted on this topography surface.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ElementId> GetHostedSubRegionIds()
```

Visual Basic
---
```text
Public Function GetHostedSubRegionIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetHostedSubRegionIds()
```

# ### Return Value
The hosted subregion ids.
# Remarks
This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad). This applies to TopographySurface and SiteSubRegion elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This element is not a TopographySurface. |

# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace